<h1>Table of Contents<span class="tocSkip"></span></h1>

<div class="toc"><ul class="toc-item"><li><span><a href="#-Homework-2-(Topics-5-7:-Groupby,-Merge,-Visualization)" data-toc-modified-id="-Homework-2-(Topics-5-7:-Groupby,-Merge,-Visualization)-1"><span class="toc-item-num">1&nbsp;&nbsp;</span><center> Homework 2 (Topics 5-7: Groupby, Merge, Visualization)</center></a></span><ul class="toc-item"><li><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Task-0." data-toc-modified-id="Task-0.-1.0.0.1"><span class="toc-item-num">1.0.0.1&nbsp;&nbsp;</span>Task 0.</a></span></li><li><span><a href="#Task-1." data-toc-modified-id="Task-1.-1.0.0.2"><span class="toc-item-num">1.0.0.2&nbsp;&nbsp;</span>Task 1.</a></span></li><li><span><a href="#Task-2:" data-toc-modified-id="Task-2:-1.0.0.3"><span class="toc-item-num">1.0.0.3&nbsp;&nbsp;</span>Task 2:</a></span></li><li><span><a href="#Task-3:" data-toc-modified-id="Task-3:-1.0.0.4"><span class="toc-item-num">1.0.0.4&nbsp;&nbsp;</span>Task 3:</a></span></li><li><span><a href="#Task-4:" data-toc-modified-id="Task-4:-1.0.0.5"><span class="toc-item-num">1.0.0.5&nbsp;&nbsp;</span>Task 4:</a></span></li><li><span><a href="#Task-5:" data-toc-modified-id="Task-5:-1.0.0.6"><span class="toc-item-num">1.0.0.6&nbsp;&nbsp;</span>Task 5:</a></span></li><li><span><a href="#Вопросы:" data-toc-modified-id="Вопросы:-1.0.0.7"><span class="toc-item-num">1.0.0.7&nbsp;&nbsp;</span>Вопросы:</a></span></li><li><span><a href="#Task-6:" data-toc-modified-id="Task-6:-1.0.0.8"><span class="toc-item-num">1.0.0.8&nbsp;&nbsp;</span>Task 6:</a></span></li><li><span><a href="#Вопросы:" data-toc-modified-id="Вопросы:-1.0.0.9"><span class="toc-item-num">1.0.0.9&nbsp;&nbsp;</span>Вопросы:</a></span></li></ul></li></ul></li></ul></li></ul></div>

# <center> Homework 2 (Topics 5-7: Groupby, Merge, Visualization)

In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

pd.set_option("display.max_rows", 5)
print('Done')

Done

Ещё раз (как и в задании 1) считайте в переменные `tr_mcc_codes`, `tr_types`, `transactions` и `customers_gender_train`. В `transactions` опять считайте только первые `1 000 000` строк.

In [2]:
### Type your code here

# Task 0.

Соедините `transactions` с всеми остальными таблицами (`tr_mcc_codes`, `tr_types`, `gender_train`). Причём с `customers_gender_train` необходимо объединиться с помощью `left join`, а с оставшимися датафреймами - через `inner`.

После получения результата таблицы `gender_train`, `tr_types`, `tr_mcc_codes` можно удалить. В результате соединения датафреймов должно получиться `999584` строки.

In [3]:
### Type your code here

In [2]:
trans = pd.read_csv('Python And Data Analysis/data/transactions.csv', nrows=1000000)
mcc = pd.read_csv('Python And Data Analysis/data/tr_mcc_codes.csv', sep=';')
types = pd.read_csv('Python And Data Analysis/data/tr_types.csv', sep=';')
gender = pd.read_csv('Python And Data Analysis/data/gender_train.csv')

In [5]:
mcc

     mcc_code                                    mcc_description
0         742                                Ветеринарные услуги
1        1711  Генеральные подрядчики по вентиляции, теплосна...
..        ...                                                ...
182      9399  Правительственные услуги, нигде ранее не класс...
183      9402             Почтовые услуги — только правительство

[184 rows x 2 columns]

In [6]:
trans_gender = pd.merge(trans, gender, how='left', on='customer_id')
trans_gm = pd.merge(trans_gender, mcc, how='inner', on='mcc_code')
df = pd.merge(trans_gm, types, how='inner', on='tr_type')
df

,customer_id,tr_datetime,mcc_code,tr_type,amount,term_id,gender,mcc_description,tr_description
0,39026145,0 10:23:26,4814,1030,-2245.92,NaN,1.0,"Звонки с использованием телефонов, считывающих...",Оплата услуги. Банкоматы СБ РФ
1,39026145,6 07:08:31,4814,1030,-5614.79,NaN,1.0,"Звонки с использованием телефонов, считывающих...",Оплата услуги. Банкоматы СБ РФ
...,...,...,...,...,...,...,...,...,...
999582,89619970,104 23:39:35,3000,6000,408307.49,NaN,NaN,"Авиалинии, авиакомпании",Возврат покупки. ТУ СБ РФ
999583,89619970,105 23:38:49,3000,6000,204153.74,NaN,NaN,"Авиалинии, авиакомпании",Возврат покупки. ТУ СБ РФ

# Task 1.

Определите модуль разницы между средними тратами женщин и мужчин (трата - отрицательное значение `amount`). (*)

Выведите ответ в виде вещественного числа, округлённого до двух знаков после запятой, отделив дробную часть точкой в формате `"123.45"`

**Пояснения**:  
(\*) Если в результате для мужчин получились значения `[-1,-3,-5]`, а для женщин `[-1,-2,-3]`,  
то модуль разницы между средними арифметическими ``-3` и ``-2` будет равен 1.

(\*\*) Обратите внимание, что для вычисления модуля разности точных знаний о том, какой класc относится к мужчинам, а какой к женщинам, пока не требуется.

(\*\*\*) Округление не нужно производить отдельно по средним тратам женщин и мужчин, а только в самом конце, когда получите значение модуля разницы трат.

In [7]:
### Type your code here

In [8]:
costs = df.loc[df.amount < 0]
costs

,customer_id,tr_datetime,mcc_code,tr_type,amount,term_id,gender,mcc_description,tr_description
0,39026145,0 10:23:26,4814,1030,-2245.92,NaN,1.0,"Звонки с использованием телефонов, считывающих...",Оплата услуги. Банкоматы СБ РФ
1,39026145,6 07:08:31,4814,1030,-5614.79,NaN,1.0,"Звонки с использованием телефонов, считывающих...",Оплата услуги. Банкоматы СБ РФ
...,...,...,...,...,...,...,...,...,...
999565,62693770,333 19:26:37,4900,2320,-72385.87,888917,0.0,"Коммунальные услуги — электричество, газ, сани...",Безналичный перевод денежных средств через POS
999566,62693770,333 19:27:26,4900,2320,-4491.83,888917,0.0,"Коммунальные услуги — электричество, газ, сани...",Безналичный перевод денежных средств через POS

In [9]:
difference = costs.groupby('gender')['amount'].mean().diff()[1]
# difference = costs.groupby('gender').amount.mean().diff()
abs(round(difference, 2))

32718.05

# Task 2

1. Создайте новый столбец `mcc_code+tr_type`, сконкатенировав значения из соответствующих столбцов. (\*)
2. Оставьте только наблюдения с отрицательным значением `amount`. Посчитайте дисперсию по категориям получившегося столбца `mcc_code+tr_type`, в которых количество наблюдений `>= 10`. 
3. Определите отношение максимальной дисперсии к минимальной.

Выведите ответ в виде вещественного числа, округлённого до ближайшего целого в формате `"123456"` без дробной части.

**Пояснения**:  
(\*) Для конкатенации значений в столбцах можно использовать метод `.astype(str)`(\*\*\*) для серии и складывать соответствующие серии. Либо же применять `apply` к строкам датафрейма, прописывая логику преобразования и конкатенации значений внутри.

(\*\*) Для одновременного подсчета количества наблюдений и дисперсии по категориям можно воспользоваться функцией `.agg()`

(\*\*\*) as of now (v1.2.4), neither `astype('str')` nor `astype(str)` work. Use `.astype("string")` [Source](https://stackoverflow.com/questions/22231592/pandas-change-data-type-of-series-to-string)

In [10]:
### Type your code here

In [11]:
# New column
df['mcc_code+tr_type'] = df['mcc_code'].astype("string") + df['tr_type'].astype("string")
df

,customer_id,tr_datetime,mcc_code,tr_type,amount,term_id,gender,mcc_description,tr_description,mcc_code+tr_type
0,39026145,0 10:23:26,4814,1030,-2245.92,NaN,1.0,"Звонки с использованием телефонов, считывающих...",Оплата услуги. Банкоматы СБ РФ,48141030
1,39026145,6 07:08:31,4814,1030,-5614.79,NaN,1.0,"Звонки с использованием телефонов, считывающих...",Оплата услуги. Банкоматы СБ РФ,48141030
...,...,...,...,...,...,...,...,...,...,...
999582,89619970,104 23:39:35,3000,6000,408307.49,NaN,NaN,"Авиалинии, авиакомпании",Возврат покупки. ТУ СБ РФ,30006000
999583,89619970,105 23:38:49,3000,6000,204153.74,NaN,NaN,"Авиалинии, авиакомпании",Возврат покупки. ТУ СБ РФ,30006000

In [12]:
# df with the amount < 0
df_amount_neg = df.loc[df.amount < 0].copy()
df_amount_neg

,customer_id,tr_datetime,mcc_code,tr_type,amount,term_id,gender,mcc_description,tr_description,mcc_code+tr_type
0,39026145,0 10:23:26,4814,1030,-2245.92,NaN,1.0,"Звонки с использованием телефонов, считывающих...",Оплата услуги. Банкоматы СБ РФ,48141030
1,39026145,6 07:08:31,4814,1030,-5614.79,NaN,1.0,"Звонки с использованием телефонов, считывающих...",Оплата услуги. Банкоматы СБ РФ,48141030
...,...,...,...,...,...,...,...,...,...,...
999565,62693770,333 19:26:37,4900,2320,-72385.87,888917,0.0,"Коммунальные услуги — электричество, газ, сани...",Безналичный перевод денежных средств через POS,49002320
999566,62693770,333 19:27:26,4900,2320,-4491.83,888917,0.0,"Коммунальные услуги — электричество, газ, сани...",Безналичный перевод денежных средств через POS,49002320

In [13]:
df_copy = df_amount_neg.groupby(['mcc_code+tr_type'])['amount'].agg(['std']).copy()
df_copy

                            std
mcc_code+tr_type
17111110          200740.795365
17311010           23098.240107
...                         ...
93991510                    NaN
94021110            9950.032592

[667 rows x 1 columns]

In [14]:
# New column that counts the number of observations
df_copy['count'] = df_amount_neg.groupby('mcc_code+tr_type').size()
df_copy

                            std  count
mcc_code+tr_type
17111110          200740.795365     18
17311010           23098.240107      3
...                         ...    ...
93991510                    NaN      1
94021110            9950.032592      3

[667 rows x 2 columns]

In [15]:
# filtering observations
df_final = df_copy.loc[df_copy['count'] >= 10]
df_final

                            std  count
mcc_code+tr_type
17111110          200740.795365     18
17991110          134347.476562     57
...                         ...    ...
93991100          228895.552794    157
93991200          135759.338076     18

[408 rows x 2 columns]

In [16]:
# calculating the ratio of min amx std
maximum = df_final['std'].max()
minimum = df_final['std'].min()
int(maximum/minimum)

3028

# Task 3.

1. По всем типам транзакций рассчитайте максимальную сумму прихода на карту (из строго положительных сумм по столбцу `amount`) отдельно для мужчин и женщин (назовите ее `max_income`). Оставьте по 5 транзакций для мужчин и для женщин, наименьших среди всех транзакций по полученным значениям `max_income`. (\*)
2. Выделите среди них те, которые встречаются одновременно и у мужчин, и у женщин:
    ```
    1) Покупка. POS ТУ СБ РФ	
    2) Списание после проведения претензионной работы	
    3) **Плата за получение наличных. Россия**	
    4) Перевод на карту/ с карты через АТМ (со взиманием комиссии с отправителя) по счету в овердрафте	
    5) Плата за получение наличных в АТМ. Россия	 
    6) Наличные. Зарубеж. банк	
    7) Возврат покупки. POS ТУ Россия
    ```

**Пояснения**:  
(\*) Если максимальные суммы приходов по каким-то типам были равны `[1,2,3,4,5,6,7,8]`, то 5 минимальных из них: `[1,2,3,4,5]`.

In [17]:
### Type your code here

In [18]:
pd.set_option("display.max_rows", 5)

df_copy = df.loc[df.amount > 0].set_index('tr_type').copy()
df_copy

,customer_id,tr_datetime,mcc_code,amount,term_id,gender,mcc_description,tr_description,mcc_code+tr_type
tr_type,,,,,,,,,
1100,22053688,20 00:00:00,4814,15721.41,NaN,1.0,"Звонки с использованием телефонов, считывающих...",Покупка. ТУ Россия,48141100
1100,91330600,20 00:00:00,4814,11229.58,NaN,1.0,"Звонки с использованием телефонов, считывающих...",Покупка. ТУ Россия,48141100
...,...,...,...,...,...,...,...,...,...
6000,89619970,104 23:39:35,3000,408307.49,NaN,NaN,"Авиалинии, авиакомпании",Возврат покупки. ТУ СБ РФ,30006000
6000,89619970,105 23:38:49,3000,204153.74,NaN,NaN,"Авиалинии, авиакомпании",Возврат покупки. ТУ СБ РФ,30006000

In [19]:
# tmp = df_copy.set_index(['tr_type', 'gender'])
max_income = df_copy.groupby(['tr_type', 'gender']).max('amount').amount.unstack()
max_income

gender          0.0        1.0
tr_type
1010       24839.83   28803.87
1100     2097006.17  163727.26
...             ...        ...
8100            NaN   64682.37
8145      320145.86        NaN

[40 rows x 2 columns]

In [20]:
# max_income = df_copy.groupby(['gender', 'tr_type']).max('amount')
# max_income = max_income.amount.unstack('gender')
# max_income

In [21]:
class_0 = max_income[0].dropna().sort_values().iloc[:5]
class_0

tr_type
4051    1122.96
4110    2245.92
4210    2245.92
2370    2335.75
4100    5041.86
Name: 0.0, dtype: float64

In [22]:
class_1 = max_income[1].dropna().sort_values().iloc[:5]
class_1

tr_type
4110     2245.92
2020     2245.92
1010    28803.87
8100    64682.37
6000    79280.83
Name: 1.0, dtype: float64

In [23]:
class_merge = pd.merge(class_0, class_1, on='tr_type', how='inner')
class_merge

             0.0      1.0
tr_type
4110     2245.92  2245.92

In [24]:
df_copy.loc[class_merge.index, 'tr_description'].iloc[0]

'Плата за получение наличных в АТМ. Россия'

# Task 4.

1. Выделите из поля `tr_datetime` относительный день `tr_day` (первое число до точного времени). (\*)
2. Отфильтруйте строки таким образом, чтобы оставить только те транзакции, у которых в соответствующий относительный день `tr_day` количество уникальных `MCC` кодов при транзакциях было больше `75` (можно воспользоваться функцией `nunique()`)
3. Сгруппируйте полученный отфильтрованный датафрейм по `MCC` коду и полу, после чего, пронализировав результат, выберите верные варианты ответов ниже (\*\*): 
    ```
    1) gender == 0 - женщины, gender == 1 - мужчины
    2) gender == 1 - женщины, gender == 0 - мужчины
    3) Абсолютное значение медианы с типом "Флористика" (расходов/приходов) у мужчин выше той же медианы у женщин
    4) Абсолютное значение медианы женских трат (расходов/приходов) на ценные бумаги выше мужских
    5) Абсолютное значение медианы женских трат (расходов/приходов) в категории "Бары, коктейль-бары, дискотеки, ночные клубы и таверны — места продажи алкогольных напитков" ниже мужских
    ```
    
**Пояснения**:  
(\*) Для того, чтобы выделить всё, что стоит до первого пробела, можо использовать строковые методы для датафрейма - `.str.split()` ([source](https://stackoverflow.com/questions/45983017/extracting-an-element-of-a-list-in-a-pandas-column)), например. Либо же реализовывать логику выделения подстроки с помощью метода `apply`.  
(\*\*) Понять, какой класс к какому типу транзакций (мужские/женские) относится можно, если поизучать типичные для мужчин/женщин категории и сравнить средние/медианы расходов и/или приходов в них.

In [25]:
### Type your code here

In [24]:
trans_gender = pd.merge(trans, gender, how='left', on='customer_id')
trans_gm = pd.merge(trans_gender, mcc, how='inner', on='mcc_code')
df = pd.merge(trans_gm, types, how='inner', on='tr_type')
df

,customer_id,tr_datetime,mcc_code,tr_type,amount,term_id,gender,mcc_description,tr_description
0,39026145,0 10:23:26,4814,1030,-2245.92,NaN,1.0,"Звонки с использованием телефонов, считывающих...",Оплата услуги. Банкоматы СБ РФ
1,39026145,6 07:08:31,4814,1030,-5614.79,NaN,1.0,"Звонки с использованием телефонов, считывающих...",Оплата услуги. Банкоматы СБ РФ
...,...,...,...,...,...,...,...,...,...
999582,89619970,104 23:39:35,3000,6000,408307.49,NaN,NaN,"Авиалинии, авиакомпании",Возврат покупки. ТУ СБ РФ
999583,89619970,105 23:38:49,3000,6000,204153.74,NaN,NaN,"Авиалинии, авиакомпании",Возврат покупки. ТУ СБ РФ

In [25]:
df_copy = df[['mcc_code', 'gender']].copy()
df_copy

        mcc_code  gender
0           4814     1.0
1           4814     1.0
...          ...     ...
999582      3000     NaN
999583      3000     NaN

[999584 rows x 2 columns]

In [26]:
df_copy['tr_day'] = df['tr_datetime'].str.split().str[0]
# df_copy = df_copy.set_index('tr_day')
df_copy

        mcc_code  gender tr_day
0           4814     1.0      0
1           4814     1.0      6
...          ...     ...    ...
999582      3000     NaN    104
999583      3000     NaN    105

[999584 rows x 3 columns]

In [42]:
tr_groups = df_copy.groupby(['tr_day'])
f = tr_groups.mcc_code.nunique() > 75
f

tr_day
0     False
1     False
      ...
98    False
99    False
Name: mcc_code, Length: 457, dtype: bool

In [38]:
f.index

Index(['0', '1', '10', '100', '101', '102', '103', '104', '105', '106',
       ...
       '90', '91', '92', '93', '94', '95', '96', '97', '98', '99'],
      dtype='object', name='tr_day', length=457)

In [39]:
df_copy['tr_day'][1]

'6'

In [41]:
for i in range(10):
    if df_copy['tr_day'][i] :
        print(df_copy['tr_day'][i])

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

#### Task 5:
1. Разбейте расходы (отрицательные значения сумм) на 5 бакетов amount_bucket равного объёма (с помощью pd.qcut), разбив все траты на категории 'Very High', 'High', 'Middle', 'Low', 'Very Low'. (\*)
2. Оставшиеся неотрицательные траты отнесите к категории 'Income'.
(воспользуйтесь функцией .cat.add_categories('Income') для того, чтобы добавить новую категорию 'Income' к категориям 'Very High', 'High', 'Middle', 'Low', 'Very Low', а затем заполните пустые значения новой категорией).
3. Из поля tr_datetime выделите час tr_hour, в который произошла транзакция, как первые 2 цифры до ":". (\**)
3. После этого постройте сводную таблицу, значениями в которой является пол gender, индексы - tr_hour, столбцы - amount_bucket.
4. Отрисуйте полученные результаты, передав их в функцию plot_pivot_table, расположенную ниже.
5. Выберите верные ответы на вопросы ниже.

#### Вопросы:
    - 1) Ночные поступления денег (01-05 часов) в более чем 85% случаев являются мужскими.
    - 2) Посмотрев на долю мужчин в поступлениях средств (Income), можно сделать вывод, что количество поступлений средств женщинам в целом больше, чем мужчинам.
    - 3) Самые низкие траты в 3 часа ночи осуществляются в более 70% случаев женщинами.
    - 4) Существуют особые часы в мелких тратах, когда женщины тратят намного больше мужчин (>80%)
    - 5) Посмотрев на долю мужчин в максимальных тратах средств (Very High), можно сделать вывод, что количество высоких трат в каждый возможный час мужчин больше, чем у женщин.

##### Пояснения:
(\*) Обратите внимание, что в категории Very High Должны оказаться максимальные по модулю отрицательные транзакции. <br>
(\**) Например, для строки "0 10:23:26" час будет равен 10, а для строки "6 07:08:31"- 07. Можно воспользоваться функциями str.split() или str.find() и 
функцией .apply(lambda x: x[])

In [11]:
def plot_pivot_table(pivot_table):
    plt.figure(figsize=(9, 11))
    sns.heatmap(pivot_table, cmap="YlGnBu", annot=True, 
                fmt='.3g', annot_kws={"size": 14, "fontsize": 14})
    plt.xticks(fontsize=15)
    plt.yticks(rotation=0, fontsize=15)
    plt.xlabel('Bucket', size=18)
    plt.ylabel('Hour', fontsize=18)
    plt.title('Gender analysis per bucket and hour', fontsize=20)
    plt.show()

In [8]:
# Type your code here

#### Task 6:
1. Измените тип поля tr_day на int.
2. Выберите из transactions все MCC коды, которые встретились в выборке более чем 60000 раз.
3. Сгруппируйте отфильтрованный датафрейм по дню и MCC-коду, получая средние значения суммы amount.  
4. Далее отрисуйте зависимость средних сумм (может пригодится метод unstack()) по каждому из MCC-кодов по дням.
5. Выберите верные ответы на вопросы ниже.

#### Вопросы:
    - 1) 2 из полученных MCC-кодов связаны с финансовыми институтами
    - 2) 2 MCC кода, связанные со снятием наличности имеют в целом разные знаки (в одном случае почти везде - траты, в другом - пополнения)
    - 3) Бакалейные магазины обладают максимальными средними тратами среди выбранных MCC-кодов
    - 4) Денежные переводы имеют как минимум 3 явных минимума средних
    - 5) Категория "Звонки с использованием телефонов, считывающих магнитную ленту" имеет визуально очень большую дисперсию.

In [9]:
# Type your code here